/********************************************************************************************
*                              
*                              dp水題。好久沒寫dp了。
*                              
*                              
********************************************************************************************/
#include <bits/stdc++.h>
using namespace std;

int main()
{
    //ios::sync_with_stdio(false);
    //cin.tie(0);
    long long n,a[55];
    a[0]=1;a[1]=1;
    for(int i=2;i<55;i++)
    {
        a[i]=a[i-1]+a[i-2];
    }
    while(cin >> n && n!=0)
    {
        cout << a[n] << endl;
    }
    return 0;

}